espressif/esp-idf/components/soc/esp32p4/include/soc/rmt_struct.h
/** Type of chm_rx_carrier_rm register
 *  Channel m carrier remove register
 */
typedef union {
    struct {
        /** carrier_low_thres_ch4 : R/W; bitpos: [15:0]; default: 0;
         *  The low level period in a carrier modulation mode is
         *  (REG_RMT_REG_CARRIER_LOW_THRES_CHm + 1) for channel m.
         */
        uint32_t carrier_low_thres_ch4:16;
        /** carrier_high_thres_ch4 : R/W; bitpos: [31:16]; default: 0;
         *  The high level period in a carrier modulation mode is
         *  (REG_RMT_REG_CARRIER_HIGH_THRES_CHm + 1) for channel m.
         */
        uint32_t carrier_high_thres_ch4:16;
    };
    uint32_t val;
} rmt_chm_rx_carrier_rm_reg_t;

/** Type of sys_conf register
 *  RMT apb configuration register
 */
typedef union {
    struct {
        /** apb_fifo_mask : R/W; bitpos: [0]; default: 0;
         *  1'h1: access memory directly.   1'h0: access memory by FIFO.
         */
        uint32_t apb_fifo_mask:1;
        /** mem_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  Set this bit to enable the clock for RMT memory.
         */
        uint32_t mem_clk_force_on:1;
        /** mem_force_pd : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down RMT memory.
         */
        uint32_t mem_force_pd:1;
        /** mem_force_pu : R/W; bitpos: [3]; default: 0;
         *  1: Disable RMT memory light sleep power down function. 0: Power down RMT memory
         *  when RMT is in light sleep mode.
         */
        uint32_t mem_force_pu:1;
        /** sclk_div_num : R/W; bitpos: [11:4]; default: 1;
         *  the integral part of the fractional divisor
         */
        uint32_t sclk_div_num:8;
        /** sclk_div_a : R/W; bitpos: [17:12]; default: 0;
         *  the numerator of the fractional part of the fractional divisor
         */
        uint32_t sclk_div_a:6;
        /** sclk_div_b : R/W; bitpos: [23:18]; default: 0;
         *  the denominator of the fractional part of the fractional divisor
         */
        uint32_t sclk_div_b:6;
        /** sclk_sel : R/W; bitpos: [25:24]; default: 1;
         *  choose the clock source of rmt_sclk. 1:CLK_80Mhz.2:CLK_8MHz.3:XTAL
         */
        uint32_t sclk_sel:2;
        /** sclk_active : R/W; bitpos: [26]; default: 1;
         *  rmt_sclk switch
         */
        uint32_t sclk_active:1;
        uint32_t reserved_27:4;
        /** clk_en : R/W; bitpos: [31]; default: 0;
         *  RMT register clock gate enable signal. 1: Power up the drive clock of registers. 0:
         *  Power down the drive clock of registers
         */
        uint32_t clk_en:1;
    };
    uint32_t val;
} rmt_sys_conf_reg_t;

/** Type of ref_cnt_rst register
 *  RMT clock divider reset register
 */
typedef union {
    struct {
        /** ref_cnt_rst_ch0 : WT; bitpos: [0]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL0.
         */
        uint32_t ref_cnt_rst_ch0:1;
        /** ref_cnt_rst_ch1 : WT; bitpos: [1]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL1.
         */
        uint32_t ref_cnt_rst_ch1:1;
        /** ref_cnt_rst_ch2 : WT; bitpos: [2]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL2.
         */
        uint32_t ref_cnt_rst_ch2:1;
        /** ref_cnt_rst_ch3 : WT; bitpos: [3]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL3.
         */
        uint32_t ref_cnt_rst_ch3:1;
        /** ref_cnt_rst_ch4 : WT; bitpos: [4]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL4.
         */
        uint32_t ref_cnt_rst_ch4:1;
        /** ref_cnt_rst_ch5 : WT; bitpos: [5]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL5.
         */
        uint32_t ref_cnt_rst_ch5:1;
        /** ref_cnt_rst_ch6 : WT; bitpos: [6]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL6.
         */
        uint32_t ref_cnt_rst_ch6:1;
        /** ref_cnt_rst_ch7 : WT; bitpos: [7]; default: 0;
         *  This register is used to reset the clock divider of CHANNEL7.
         */
        uint32_t ref_cnt_rst_ch7:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} rmt_ref_cnt_rst_reg_t;


/** Group: Status registers */
/** Type of chnstatus register
 *  Channel n status register
 */
typedef union {
    struct {
        /** mem_raddr_ex_ch0 : RO; bitpos: [9:0]; default: 0;
         *  This register records the memory address offset when transmitter of CHANNELn is
         *  using the RAM.
         */
        uint32_t mem_raddr_ex_ch0:10;
        uint32_t reserved_10:1;
        /** apb_mem_waddr_ch0 : RO; bitpos: [20:11]; default: 0;
         *  This register records the memory address offset when writes RAM over APB bus.
         */
        uint32_t apb_mem_waddr_ch0:10;
        uint32_t reserved_21:1;
        /** state_ch0 : RO; bitpos: [24:22]; default: 0;
         *  This register records the FSM status of CHANNELn.
         */
        uint32_t state_ch0:3;
        /** mem_empty_ch0 : RO; bitpos: [25]; default: 0;
         *  This status bit will be set when the data to be set is more than memory size and
         *  the wraparound mode is disabled.
         */
        uint32_t mem_empty_ch0:1;
        /** apb_mem_wr_err_ch0 : RO; bitpos: [26]; default: 0;
         *  This status bit will be set if the offset address out of memory size when writes
         *  via APB bus.
         */
        uint32_t apb_mem_wr_err_ch0:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} rmt_chnstatus_reg_t;

/** Type of chmstatus register
 *  Channel m status register
 */
typedef union {
    struct {
        /** mem_waddr_ex_ch4 : RO; bitpos: [9:0]; default: 192;
         *  This register records the memory address offset when receiver of CHANNELm is using
         *  the RAM.
         */
        uint32_t mem_waddr_ex_ch4:10;
        uint32_t reserved_10:1;
        /** apb_mem_raddr_ch4 : RO; bitpos: [20:11]; default: 192;
         *  This register records the memory address offset when reads RAM over APB bus.
         */
        uint32_t apb_mem_raddr_ch4:10;
        uint32_t reserved_21:1;
        /** state_ch4 : RO; bitpos: [24:22]; default: 0;
         *  This register records the FSM status of CHANNELm.
         */
        uint32_t state_ch4:3;
        /** mem_owner_err_ch4 : RO; bitpos: [25]; default: 0;
         *  This status bit will be set when the ownership of memory block is wrong.
         */
        uint32_t mem_owner_err_ch4:1;
        /** mem_full_ch4 : RO; bitpos: [26]; default: 0;
         *  This status bit will be set if the receiver receives more data than the memory size.
         */
        uint32_t mem_full_ch4:1;
        /** apb_mem_rd_err_ch4 : RO; bitpos: [27]; default: 0;
         *  This status bit will be set if the offset address out of memory size when reads via
         *  APB bus.
         */
        uint32_t apb_mem_rd_err_ch4:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} rmt_chmstatus_reg_t;


/** Group: Interrupt registers */
/** Type of int_raw register
 *  Raw interrupt status
 */
typedef union {
    struct {
        /** ch0_tx_end_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The interrupt raw bit for CHANNEL0. Triggered when transmission done.
         */
        uint32_t ch0_tx_end_int_raw:1;
        /** ch1_tx_end_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The interrupt raw bit for CHANNEL1. Triggered when transmission done.
         */
        uint32_t ch1_tx_end_int_raw:1;
        /** ch2_tx_end_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The interrupt raw bit for CHANNEL2. Triggered when transmission done.
         */
        uint32_t ch2_tx_end_int_raw:1;
        /** ch3_tx_end_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The interrupt raw bit for CHANNEL3. Triggered when transmission done.
         */
        uint32_t ch3_tx_end_int_raw:1;
        /** ch0_err_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The interrupt raw bit for CHANNEL0. Triggered when error occurs.
         */
        uint32_t ch0_err_int_raw:1;
        /** ch1_err_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The interrupt raw bit for CHANNEL1. Triggered when error occurs.
         */
        uint32_t ch1_err_int_raw:1;
        /** ch2_err_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The interrupt raw bit for CHANNEL2. Triggered when error occurs.
         */
        uint32_t ch2_err_int_raw:1;
        /** ch3_err_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The interrupt raw bit for CHANNEL3. Triggered when error occurs.
         */
        uint32_t ch3_err_int_raw:1;
        /** ch0_tx_thr_event_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The interrupt raw bit for CHANNEL0. Triggered when transmitter sent more data than
         *  configured value.
         */
        uint32_t ch0_tx_thr_event_int_raw:1;
        /** ch1_tx_thr_event_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The interrupt raw bit for CHANNEL1. Triggered when transmitter sent more data than
         *  configured value.
         */
        uint32_t ch1_tx_thr_event_int_raw:1;
        /** ch2_tx_thr_event_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The interrupt raw bit for CHANNEL2. Triggered when transmitter sent more data than
         *  configured value.
         */
        uint32_t ch2_tx_thr_event_int_raw:1;
        /** ch3_tx_thr_event_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The interrupt raw bit for CHANNEL3. Triggered when transmitter sent more data than
         *  configured value.
         */
        uint32_t ch3_tx_thr_event_int_raw:1;
        /** ch0_tx_loop_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The interrupt raw bit for CHANNEL0. Triggered when the loop count reaches the
         *  configured threshold value.
         */
        uint32_t ch0_tx_loop_int_raw:1;
        /** ch1_tx_loop_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The interrupt raw bit for CHANNEL1. Triggered when the loop count reaches the
         *  configured threshold value.
         */
        uint32_t ch1_tx_loop_int_raw:1;
        /** ch2_tx_loop_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The interrupt raw bit for CHANNEL2. Triggered when the loop count reaches the
         *  configured threshold value.
         */
        uint32_t ch2_tx_loop_int_raw:1;
        /** ch3_tx_loop_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The interrupt raw bit for CHANNEL3. Triggered when the loop count reaches the
         *  configured threshold value.
         */
        uint32_t ch3_tx_loop_int_raw:1;
        /** ch4_rx_end_int_raw : R/WTC/SS; bitpos: [16]; default: 0;
         *  The interrupt raw bit for CHANNEL4. Triggered when reception done.
         */
        uint32_t ch4_rx_end_int_raw:1;
        /** ch5_rx_end_int_raw : R/WTC/SS; bitpos: [17]; default: 0;
         *  The interrupt raw bit for CHANNEL5. Triggered when reception done.
         */
        uint32_t ch5_rx_end_int_raw:1;
        /** ch6_rx_end_int_raw : R/WTC/SS; bitpos: [18]; default: 0;
         *  The interrupt raw bit for CHANNEL6. Triggered when reception done.
         */
        uint32_t ch6_rx_end_int_raw:1;
        /** ch7_rx_end_int_raw : R/WTC/SS; bitpos: [19]; default: 0;
         *  The interrupt raw bit for CHANNEL7. Triggered when reception done.
         */
        uint32_t ch7_rx_end_int_raw:1;
        /** ch4_err_int_raw : R/WTC/SS; bitpos: [20]; default: 0;
         *  The interrupt raw bit for CHANNEL4. Triggered when error occurs.
         */
        uint32_t ch4_err_int_raw:1;
        /** ch5_err_int_raw : R/WTC/SS; bitpos: [21]; default: 0;
         *  The interrupt raw bit for CHANNEL5. Triggered when error occurs.
         */
        uint32_t ch5_err_int_raw:1;
        /** ch6_err_int_raw : R/WTC/SS; bitpos: [22]; default: 0;
         *  The interrupt raw bit for CHANNEL6. Triggered when error occurs.
         */
        uint32_t ch6_err_int_raw:1;
        /** ch7_err_int_raw : R/WTC/SS; bitpos: [23]; default: 0;
         *  The interrupt raw bit for CHANNEL7. Triggered when error occurs.
         */
        uint32_t ch7_err_int_raw:1;
        /** ch4_rx_thr_event_int_raw : R/WTC/SS; bitpos: [24]; default: 0;
         *  The interrupt raw bit for CHANNEL4. Triggered when receiver receive more data than
         *  configured value.
         */
        uint32_t ch4_rx_thr_event_int_raw:1;
        /** ch5_rx_thr_event_int_raw : R/WTC/SS; bitpos: [25]; default: 0;
         *  The interrupt raw bit for CHANNEL5. Triggered when receiver receive more data than
         *  configured value.
         */
        uint32_t ch5_rx_thr_event_int_raw:1;
        /** ch6_rx_thr_event_int_raw : R/WTC/SS; bitpos: [26]; default: 0;
         *  The interrupt raw bit for CHANNEL6. Triggered when receiver receive more data than
         *  configured value.
         */
        uint32_t ch6_rx_thr_event_int_raw:1;
        /** ch7_rx_thr_event_int_raw : R/WTC/SS; bitpos: [27]; default: 0;
         *  The interrupt raw bit for CHANNEL7. Triggered when receiver receive more data than
         *  configured value.
         */
        uint32_t ch7_rx_thr_event_int_raw:1;
        /** ch3_dma_access_fail_int_raw : R/WTC/SS; bitpos: [28]; default: 0;
         *  The interrupt raw bit for CHANNEL3. Triggered when dma accessing CHANNEL3 fails.
         */
        uint32_t ch3_dma_access_fail_int_raw:1;
        /** ch7_dma_access_fail_int_raw : R/WTC/SS; bitpos: [29]; default: 0;
         *  The interrupt raw bit for CHANNEL7. Triggered when dma accessing CHANNEL7 fails.
         */
        uint32_t ch7_dma_access_fail_int_raw:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} rmt_int_raw_reg_t;

/** Type of int_st register
 *  Masked interrupt status
 */
typedef union {
    struct {
        /** ch0_tx_end_int_st : RO; bitpos: [0]; default: 0;
         *  The masked interrupt status bit for CH0_TX_END_INT.
         */
        uint32_t ch0_tx_end_int_st:1;
        /** ch1_tx_end_int_st : RO; bitpos: [1]; default: 0;
         *  The masked interrupt status bit for CH1_TX_END_INT.
         */
        uint32_t ch1_tx_end_int_st:1;
        /** ch2_tx_end_int_st : RO; bitpos: [2]; default: 0;
         *  The masked interrupt status bit for CH2_TX_END_INT.
         */
        uint32_t ch2_tx_end_int_st:1;
        /** ch3_tx_end_int_st : RO; bitpos: [3]; default: 0;
         *  The masked interrupt status bit for CH3_TX_END_INT.
         */
        uint32_t ch3_tx_end_int_st:1;
        /** ch0_err_int_st : RO; bitpos: [4]; default: 0;
         *  The masked interrupt status bit for CH0_ERR_INT.
         */
        uint32_t ch0_err_int_st:1;
        /** ch1_err_int_st : RO; bitpos: [5]; default: 0;
         *  The masked interrupt status bit for CH1_ERR_INT.
         */
        uint32_t ch1_err_int_st:1;
        /** ch2_err_int_st : RO; bitpos: [6]; default: 0;
         *  The masked interrupt status bit for CH2_ERR_INT.
         */
        uint32_t ch2_err_int_st:1;
        /** ch3_err_int_st : RO; bitpos: [7]; default: 0;
         *  The masked interrupt status bit for CH3_ERR_INT.
         */
        uint32_t ch3_err_int_st:1;
        /** ch0_tx_thr_event_int_st : RO; bitpos: [8]; default: 0;
         *  The masked interrupt status bit for CH0_TX_THR_EVENT_INT.
         */
        uint32_t ch0_tx_thr_event_int_st:1;
        /** ch1_tx_thr_event_int_st : RO; bitpos: [9]; default: 0;
         *  The masked interrupt status bit for CH1_TX_THR_EVENT_INT.
         */
        uint32_t ch1_tx_thr_event_int_st:1;
        /** ch2_tx_thr_event_int_st : RO; bitpos: [10]; default: 0;
         *  The masked interrupt status bit for CH2_TX_THR_EVENT_INT.
         */
        uint32_t ch2_tx_thr_event_int_st:1;
        /** ch3_tx_thr_event_int_st : RO; bitpos: [11]; default: 0;
         *  The masked interrupt status bit for CH3_TX_THR_EVENT_INT.
         */
        uint32_t ch3_tx_thr_event_int_st:1;
        /** ch0_tx_loop_int_st : RO; bitpos: [12]; default: 0;
         *  The masked interrupt status bit for CH0_TX_LOOP_INT.
         */
        uint32_t ch0_tx_loop_int_st:1;
        /** ch1_tx_loop_int_st : RO; bitpos: [13]; default: 0;
         *  The masked interrupt status bit for CH1_TX_LOOP_INT.
         */
        uint32_t ch1_tx_loop_int_st:1;
        /** ch2_tx_loop_int_st : RO; bitpos: [14]; default: 0;
         *  The masked interrupt status bit for CH2_TX_LOOP_INT.
         */
        uint32_t ch2_tx_loop_int_st:1;
        /** ch3_tx_loop_int_st : RO; bitpos: [15]; default: 0;
         *  The masked interrupt status bit for CH3_TX_LOOP_INT.
         */
        uint32_t ch3_tx_loop_int_st:1;
        /** ch4_rx_end_int_st : RO; bitpos: [16]; default: 0;
         *  The masked interrupt status bit for CH4_RX_END_INT.
         */
        uint32_t ch4_rx_end_int_st:1;
        /** ch5_rx_end_int_st : RO; bitpos: [17]; default: 0;
         *  The masked interrupt status bit for CH5_RX_END_INT.
         */
        uint32_t ch5_rx_end_int_st:1;
        /** ch6_rx_end_int_st : RO; bitpos: [18]; default: 0;
         *  The masked interrupt status bit for CH6_RX_END_INT.
         */
        uint32_t ch6_rx_end_int_st:1;
        /** ch7_rx_end_int_st : RO; bitpos: [19]; default: 0;
         *  The masked interrupt status bit for CH7_RX_END_INT.
         */
        uint32_t ch7_rx_end_int_st:1;
        /** ch4_err_int_st : RO; bitpos: [20]; default: 0;
         *  The masked interrupt status bit for CH4_ERR_INT.
         */
        uint32_t ch4_err_int_st:1;
        /** ch5_err_int_st : RO; bitpos: [21]; default: 0;
         *  The masked interrupt status bit for CH5_ERR_INT.
         */
        uint32_t ch5_err_int_st:1;
        /** ch6_err_int_st : RO; bitpos: [22]; default: 0;
         *  The masked interrupt status bit for CH6_ERR_INT.
         */
        uint32_t ch6_err_int_st:1;
        /** ch7_err_int_st : RO; bitpos: [23]; default: 0;
         *  The masked interrupt status bit for CH7_ERR_INT.
         */
        uint32_t ch7_err_int_st:1;
        /** ch4_rx_thr_event_int_st : RO; bitpos: [24]; default: 0;
         *  The masked interrupt status bit for CH4_RX_THR_EVENT_INT.
         */
        uint32_t ch4_rx_thr_event_int_st:1;
        /** ch5_rx_thr_event_int_st : RO; bitpos: [25]; default: 0;
         *  The masked interrupt status bit for CH5_RX_THR_EVENT_INT.
         */
        uint32_t ch5_rx_thr_event_int_st:1;
        /** ch6_rx_thr_event_int_st : RO; bitpos: [26]; default: 0;
         *  The masked interrupt status bit for CH6_RX_THR_EVENT_INT.
         */
        uint32_t ch6_rx_thr_event_int_st:1;
        /** ch7_rx_thr_event_int_st : RO; bitpos: [27]; default: 0;
         *  The masked interrupt status bit for CH7_RX_THR_EVENT_INT.
         */
        uint32_t ch7_rx_thr_event_int_st:1;
        /** ch3_dma_access_fail_int_st : RO; bitpos: [28]; default: 0;
         *  The masked interrupt status bit for  CH3_DMA_ACCESS_FAIL_INT.
         */
        uint32_t ch3_dma_access_fail_int_st:1;
        /** ch7_dma_access_fail_int_st : RO; bitpos: [29]; default: 0;
         *  The masked interrupt status bit for  CH7_DMA_ACCESS_FAIL_INT.
         */
        uint32_t ch7_dma_access_fail_int_st:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} rmt_int_st_reg_t;

